index.org
#+TITLE: Differentiable Manifolds I, Math 518, Fall 2022
  
* Basic information

  - *Lectures:* MWF 9:00--9:50am in 141 Altgeld Hall.

  - *Instructor:* [[http://pascaleff.com][James Pascaleff]]
    + *Email:* [[mailto:jpascale@illinois.edu][jpascale@illinois.edu]]; *Office:* 357 Altgeld Hall; *Phone:* (217) 244-7277.
    + *Office hours:* Wednesdays 12:00--2:00pm.

  - *Course website:* https://pascaleff.github.io/518fa22/
    + *Canvas website with gradebook:* https://canvas.illinois.edu/courses/31938

  - *Prerequisites:* Multivariable calculus. (Officially: MATH 423 or MATH 481, or consent of instructor.)

  - *Texts:* We shall follow the [[https://faculty.math.illinois.edu/~ruiloja/Meus-papers/HTML/notesDG.pdf][lecture notes on Differential Geometry]] by Rui Loja Fernandes. Two recommended textbooks are
    + John M. Lee, /Introduction to Smooth Manifolds/, Springer Graduate Texts in Mathematics volume 218.
      A full-text PDF is available through the [[https://www.library.illinois.edu/][UIUC Library]].
      *Homework problems may be assigned from this book.*
    + Michael Spivak, /A Comprehensive Introduction to Differential Geometry, Volume 1/.
    
  - *Final Exam:* Monday, December 12, 2022, 8:00--11:00am in 141 Altgeld Hall.

* Course outline

  - *Description:* Differentiable manifolds are a class of spaces that
    includes Euclidean spaces, smooth curves and surfaces in 3-space,
    higher-dimensional generalizations such as the $n$ dimensional
    spheres, and infinitely much more. Manifolds locally look like open
    sets in Euclidean space, but they may have a nontrivial global
    topology. A differentiable manifold is one where, at least locally,
    we can "do multivariable calculus" in a meaningful way. This local
    structure has consequences for the global topology. Even for
    Euclidean spaces (whose global topology is trivial) the theory of
    manifolds provides a new perspective on geometry that vastly
    generalizes traditional Euclidean geometry in multiple directions.

    The foundations of differentiable manifolds are not particularly
    simple, but they support a theory that has a lot of intuitive
    appeal. One goal of this course is to convey both the technical
    foundations and the intuitive picture.

  - *Lectures:* Lectures will be held in person.

  - *Assessment:* Grades will be based on homework (25%), a midterm
    exams (25%), and the final exam (50%). The two lowest homework
    scores will be dropped.

  - *Homework:* There will be weekly homework assignments whose due
    dates are listed in the schedule. Homework should be submitted on
    paper in class. If you are unable to come to class, you may turn
    in your homework to James Pascaleff's mailbox in the mailroom, 250
    Altgeld Hall.

  - *Exams:* There will be one midterm exam and a final exam. The
    midterm exam will be held in class on *5 October*. The final exam
    will be held Monday, December 12, 2022, 8:00--11:00am in 141
    Altgeld Hall.

* Policies

  - *Collaboration and Academic Integrity:* For homework assignments,
    collaboration is permitted and expected, but you must write up
    your solutions individually and understand them completely. On
    exams, no collaboration is permitted.

  - *Disability accommodations:* Students who require special
    accommodations should contact the instructor as soon as
    possible. Any accommodations on exams must be requested at least
    one week in advance and will require a letter from DRES.

* Homework assignments
  - Grades may be viewed on the [[https://canvas.illinois.edu/courses/31938][Canvas website]].

  - Optional homework: Watch this [[http://www.math.stonybrook.edu/Videos/IMS/Differential_Topology/][series of lectures on Differential
    Topology]] by John Milnor. Many of the ideas presented in these
    lectures will be covered in this course.

  - *Homework 1 due Friday, September 2*
    + Fernandes, p. 11: problems 4, 5.
    + Fernandes, p. 18-19: problems 1, 4, 5, 7, 9.

  - *Homework 2 due Friday, September 9*
    + Fernandes, p. 23: 2, 3.
    + Fernandes, p. 26-27: 1, 2, 3, 4, 5, 6.

  - *Homework 3 due Friday, September 16*
    + Fernandes, p. 35: 1, 2, 3, 4, 5 (all problems).

  - *Homework 4 due Friday, September 23*
    + Fernandes, p. 38: 1, 2, 3, 4, 5.
    + Fernandes, p. 46: 1, 3, 5. 

  - *Homework 5 due Friday, September 30*
    + Fernandes, p. 47: 6, 7, 8, 9.
    + Fernandes, p. 54: 1, 3, 4, 5.

  - There is no homework due on Friday, October 7.

  - *Homework 6 due Monday, October 17*
    + Fernandes, p. 55: 7, 8 (some ideas towards this were discussed in lecture).
    + Fernandes, p. 82: 2, 3, 4, 5, 6.

  - *Homework 7 due Monday, October 24*
    + Fernandes, p. 87: 1, 3, 4, 5, 6.
    + Fernandes, p. 63: 4, 5. 

  - *Homework 8 due Monday, October 31*
    + Fernandes, p. 92: 1, 3, 4, 5.
    + Fernandes, p. 98: 2, 3, 5.

  - *Homework 9 due Wednesday, November 9*
    + Fernandes, p. 99: 6, 7, 8, 10.
    + Fernandes, p. 109: 1, 3, 6. 

* Schedule
  This schedule is a tentative outline of the topics that we will cover. 
  Section numbers refer to [[https://faculty.math.illinois.edu/~ruiloja/Meus-papers/HTML/notesDG.pdf][Fernandes' notes]].
  As the semester progresses, this schedule will mutate into a log of what was covered in each lecture.

  | Week №  | Dates            | Topics/Comments                                                     |
  |---------+------------------+---------------------------------------------------------------------|
  | Week 1  | [2022-08-22 Mon] | Welcome, historical intro, diffeomorphic subsets of Euclidean space |
  |         | [2022-08-24 Wed] | Examples of smooth manifolds in Euclidean space                     |
  |         | [2022-08-26 Fri] | Abstract topological manifolds                                      |
  |---------+------------------+---------------------------------------------------------------------|
  | Week 2  | [2022-08-29 Mon] | Abstract smooth manifolds                                           |
  |         | [2022-08-31 Wed] | Manifolds with boundary                                             |
  |         | [2022-09-02 Fri] | Partitions of unity                                                 |
  |---------+------------------+---------------------------------------------------------------------|
  | Week 3  | [2022-09-05 Mon] | Labor day                                                           |
  |         | [2022-09-07 Wed] | Partitions of unity, cont'd.                                        |
  |         | [2022-09-09 Fri] | Tangent vectors                                                     |
  |---------+------------------+---------------------------------------------------------------------|
  | Week 4  | [2022-09-12 Mon] | Tangent vectors as derivations                                      |
  |         | [2022-09-14 Wed] | Tangent spaces                                                      |
  |         | [2022-09-16 Fri] | The differential of a map                                           |
  |---------+------------------+---------------------------------------------------------------------|
  | Week 5  | [2022-09-19 Mon] | The differential, cont'd.                                           |
  |         | [2022-09-21 Wed] | Immersions, submersions, and submanifolds                           |
  |         | [2022-09-23 Fri] | Submanifolds, cont'd.                                               |
  |---------+------------------+---------------------------------------------------------------------|
  | Week 6  | [2022-09-26 Mon] | Submanifolds; critical points                                       |
  |         | [2022-09-28 Wed] | Regular value theorem                                               |
  |         | [2022-09-30 Fri] | Transversal intersections                                           |
  |---------+------------------+---------------------------------------------------------------------|
  | Week 7  | [2022-10-03 Mon] | Whitney's theorem                                                   |
  |         | [2022-10-05 Wed] | *Midterm exam* covering Sections 0--6.                              |
  |         | [2022-10-07 Fri] | Vector fields                                                       |
  |---------+------------------+---------------------------------------------------------------------|
  | Week 8  | [2022-10-10 Mon] | Ordinary differential equations                                     |
  |         | [2022-10-12 Wed] | Vector fields and Flows                                             |
  |         | [2022-10-14 Fri] | Flows cont'd.                                                       |
  |---------+------------------+---------------------------------------------------------------------|
  | Week 9  | [2022-10-17 Mon] | Lie bracket and Lie derivative                                      |
  |         | [2022-10-19 Wed] | Lie bracket cont'd.                                                 |
  |         | [2022-10-21 Fri] | Foliations and distributions                                        |
  |---------+------------------+---------------------------------------------------------------------|
  | Week 10 | [2022-10-24 Mon] | The Frobenius theorem                                               |
  |         | [2022-10-26 Wed] | Lie groups and Lie algebras                                         |
  |         | [2022-10-28 Fri] | The Lie algebra of a Lie group                                      |
  |---------+------------------+---------------------------------------------------------------------|
  | Week 11 | [2022-10-31 Mon] | 15. The exponential map                                             |
  |         | [2022-11-02 Wed] | 17. Differential forms and tensor fields                            |
  |         | [2022-11-04 Fri] |                                                                     |
  |---------+------------------+---------------------------------------------------------------------|
  | Week 12 | [2022-11-07 Mon] | 18. Differential and Cartan calculus                                |
  |         | [2022-11-09 Wed] | 19. Integration on manifolds                                        |
  |         | [2022-11-11 Fri] |                                                                     |
  |---------+------------------+---------------------------------------------------------------------|
  | Week 13 | [2022-11-14 Mon] | 20. de Rham cohomology                                              |
  |         | [2022-11-16 Wed] | 21. The de Rham theorem                                             |
  |         | [2022-11-18 Fri] |                                                                     |
  |---------+------------------+---------------------------------------------------------------------|
  | Week 14 | [2022-11-21 Mon] | Fall break                                                          |
  |         | [2022-11-23 Wed] | Fall break                                                          |
  |         | [2022-11-25 Fri] | Fall break                                                          |
  |---------+------------------+---------------------------------------------------------------------|
  | Week 15 | [2022-11-28 Mon] | 22. Homotopy invariance and Mayer-Vietoris sequence                 |
  |         | [2022-11-30 Wed] | 23. Computations in cohomology                                      |
  |         | [2022-12-02 Fri] |                                                                     |
  |---------+------------------+---------------------------------------------------------------------|
  | Week 16 | [2022-12-05 Mon] | 24. The degree and the index                                        |
  |         | [2022-12-07 Wed] |                                                                     |
  |         | [2022-12-08 Thu] | Reading day                                                         |
  |         | [2022-12-09 Fri] | First day of finals                                                 |
  |---------+------------------+---------------------------------------------------------------------|
  | Week 17 | [2022-12-12 Mon] | Final Exam 8:00--11:00am in 141 Altgeld Hall                        |

