index.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2022-10-18 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Differentiable Manifolds I, Math 518, Fall 2022</title>
<meta name="generator" content="Org mode">
<link rel="stylesheet" title="Standard" href="css/worg.css" type="text/css">
<link rel="alternate stylesheet" title="Zenburn" href="css/worg-zenburn.css" type="text/css" />
<link rel="alternate stylesheet" title="Classic" href="css/worg-classic.css" type="text/css" />
<link rel="shortcut icon" href="https://math.illinois.edu/themes/custom/las_unit_theme/favicon-32x32.png" type="image/png" />
</head>
<body>
<main id="content">
<header>
<h1 class="title">Differentiable Manifolds I, Math 518, Fall 2022</h1>
</header>
<section id="outline-container-org90ee4b0" class="outline-2">
<h2 id="org90ee4b0">Basic information</h2>
<div class="outline-text-2" id="text-org90ee4b0">
<ul class="org-ul">
<li><b>Lectures:</b> MWF 9:00&#x2013;9:50am in 141 Altgeld Hall.</li>

<li><b>Instructor:</b> <a href="http://pascaleff.com">James Pascaleff</a>
<ul class="org-ul">
<li><b>Email:</b> <a href="mailto:jpascale@illinois.edu">jpascale@illinois.edu</a>; <b>Office:</b> 357 Altgeld Hall; <b>Phone:</b> (217) 244-7277.</li>
<li><b>Office hours:</b> Wednesdays 12:00&#x2013;2:00pm.</li>
</ul></li>

<li><b>Course website:</b> <a href="https://pascaleff.github.io/518fa22/">https://pascaleff.github.io/518fa22/</a>
<ul class="org-ul">
<li><b>Canvas website with gradebook:</b> <a href="https://canvas.illinois.edu/courses/31938">https://canvas.illinois.edu/courses/31938</a></li>
</ul></li>

<li><b>Prerequisites:</b> Multivariable calculus. (Officially: MATH 423 or MATH 481, or consent of instructor.)</li>

<li><b>Texts:</b> We shall follow the <a href="https://faculty.math.illinois.edu/~ruiloja/Meus-papers/HTML/notesDG.pdf">lecture notes on Differential Geometry</a> by Rui Loja Fernandes. Two recommended textbooks are
<ul class="org-ul">
<li>John M. Lee, <i>Introduction to Smooth Manifolds</i>, Springer Graduate Texts in Mathematics volume 218.
A full-text PDF is available through the <a href="https://www.library.illinois.edu/">UIUC Library</a>.
<b>Homework problems may be assigned from this book.</b></li>
<li>Michael Spivak, <i>A Comprehensive Introduction to Differential Geometry, Volume 1</i>.</li>
</ul></li>

<li><b>Final Exam:</b> Date and time TBD.</li>
</ul>
</div>
</section>

<section id="outline-container-orgb580009" class="outline-2">
<h2 id="orgb580009">Course outline</h2>
<div class="outline-text-2" id="text-orgb580009">
<ul class="org-ul">
<li><p>
<b>Description:</b> Differentiable manifolds are a class of spaces that
includes Euclidean spaces, smooth curves and surfaces in 3-space,
higher-dimensional generalizations such as the \(n\) dimensional
spheres, and infinitely much more. Manifolds locally look like open
sets in Euclidean space, but they may have a nontrivial global
topology. A differentiable manifold is one where, at least locally,
we can &ldquo;do multivariable calculus&rdquo; in a meaningful way. This local
structure has consequences for the global topology. Even for
Euclidean spaces (whose global topology is trivial) the theory of
manifolds provides a new perspective on geometry that vastly
generalizes traditional Euclidean geometry in multiple directions.
</p>

<p>
The foundations of differentiable manifolds are not particularly
simple, but they support a theory that has a lot of intuitive
appeal. One goal of this course is to convey both the technical
foundations and the intuitive picture.
</p></li>

<li><b>Lectures:</b> Lectures will be held in person.</li>

<li><b>Assessment:</b> Grades will be based on homework (25%), a midterm
exams (25%), and the final exam (50%). The two lowest homework
scores will be dropped.</li>

<li><b>Homework:</b> There will be weekly homework assignments whose due
dates are listed in the schedule. Homework should be submitted on
paper in class. If you are unable to come to class, you may turn
in your homework to James Pascaleff&rsquo;s mailbox in the mailroom, 250
Altgeld Hall.</li>

<li><b>Exams:</b> There will be one midterm exam and a final exam. The
midterm exam will be held in class on <b>5 October</b>. The final exam date and
time are TBD.</li>
</ul>
</div>
</section>

<section id="outline-container-org76a5eff" class="outline-2">
<h2 id="org76a5eff">Policies</h2>
<div class="outline-text-2" id="text-org76a5eff">
<ul class="org-ul">
<li><b>Collaboration and Academic Integrity:</b> For homework assignments,
collaboration is permitted and expected, but you must write up
your solutions individually and understand them completely. On
exams, no collaboration is permitted.</li>

<li><b>Disability accommodations:</b> Students who require special
accommodations should contact the instructor as soon as
possible. Any accommodations on exams must be requested at least
one week in advance and will require a letter from DRES.</li>
</ul>
</div>
</section>

<section id="outline-container-org6d75021" class="outline-2">
<h2 id="org6d75021">Homework assignments</h2>
<div class="outline-text-2" id="text-org6d75021">
<ul class="org-ul">
<li>Grades may be viewed on the <a href="https://canvas.illinois.edu/courses/31938">Canvas website</a>.</li>

<li>Optional homework: Watch this <a href="http://www.math.stonybrook.edu/Videos/IMS/Differential_Topology/">series of lectures on Differential
Topology</a> by John Milnor. Many of the ideas presented in these
lectures will be covered in this course.</li>

<li><b>Homework 1 due Friday, September 2</b>
<ul class="org-ul">
<li>Fernandes, p. 11: problems 4, 5.</li>
<li>Fernandes, p. 18-19: problems 1, 4, 5, 7, 9.</li>
</ul></li>

<li><b>Homework 2 due Friday, September 9</b>
<ul class="org-ul">
<li>Fernandes, p. 23: 2, 3.</li>
<li>Fernandes, p. 26-27: 1, 2, 3, 4, 5, 6.</li>
</ul></li>

<li><b>Homework 3 due Friday, September 16</b>
<ul class="org-ul">
<li>Fernandes, p. 35: 1, 2, 3, 4, 5 (all problems).</li>
</ul></li>

<li><b>Homework 4 due Friday, September 23</b>
<ul class="org-ul">
<li>Fernandes, p. 38: 1, 2, 3, 4, 5.</li>
<li>Fernandes, p. 46: 1, 3, 5.</li>
</ul></li>

<li><b>Homework 5 due Friday, September 30</b>
<ul class="org-ul">
<li>Fernandes, p. 47: 6, 7, 8, 9.</li>
<li>Fernandes, p. 54: 1, 3, 4, 5.</li>
</ul></li>

<li>There is no homework due on Friday, October 7.</li>

<li><b>Homework 6 due Monday, October 17</b>
<ul class="org-ul">
<li>Fernandes, p. 55: 7, 8 (some ideas towards this were discussed in lecture).</li>
<li>Fernandes, p. 82: 2, 3, 4, 5, 6.</li>
</ul></li>

<li><b>Homework 7 due Monday, October 24</b>
<ul class="org-ul">
<li>Fernandes, p. 87: 1, 3, 4, 5, 6.</li>
<li>Fernandes, p. 63: 4, 5.</li>
</ul></li>
</ul>
</div>
</section>

<section id="outline-container-org4d60cef" class="outline-2">
<h2 id="org4d60cef">Schedule</h2>
<div class="outline-text-2" id="text-org4d60cef">
<p>
This schedule is a tentative outline of the topics that we will cover. 
Section numbers refer to <a href="https://faculty.math.illinois.edu/~ruiloja/Meus-papers/HTML/notesDG.pdf">Fernandes&rsquo; notes</a>.
As the semester progresses, this schedule will mutate into a log of what was covered in each lecture.
</p>

<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Week №</th>
<th scope="col" class="org-left">Dates</th>
<th scope="col" class="org-left">Topics/Comments</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Week 1</td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">[2022-08-22 Mon]</span></span></td>
<td class="org-left">Welcome, historical intro, diffeomorphic subsets of Euclidean space</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">[2022-08-24 Wed]</span></span></td>
<td class="org-left">Examples of smooth manifolds in Euclidean space</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">[2022-08-26 Fri]</span></span></td>
<td class="org-left">Abstract topological manifolds</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Week 2</td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">[2022-08-29 Mon]</span></span></td>
<td class="org-left">Abstract smooth manifolds</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">[2022-08-31 Wed]</span></span></td>
<td class="org-left">Manifolds with boundary</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">[2022-09-02 Fri]</span></span></td>
<td class="org-left">Partitions of unity</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Week 3</td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">[2022-09-05 Mon]</span></span></td>
<td class="org-left">Labor day</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">[2022-09-07 Wed]</span></span></td>
<td class="org-left">Partitions of unity, cont&rsquo;d.</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">[2022-09-09 Fri]</span></span></td>
<td class="org-left">Tangent vectors</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Week 4</td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">[2022-09-12 Mon]</span></span></td>
<td class="org-left">Tangent vectors as derivations</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">[2022-09-14 Wed]</span></span></td>
<td class="org-left">Tangent spaces</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">[2022-09-16 Fri]</span></span></td>
<td class="org-left">The differential of a map</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Week 5</td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">[2022-09-19 Mon]</span></span></td>
<td class="org-left">The differential, cont&rsquo;d.</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">[2022-09-21 Wed]</span></span></td>
<td class="org-left">Immersions, submersions, and submanifolds</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">[2022-09-23 Fri]</span></span></td>
<td class="org-left">Submanifolds, cont&rsquo;d.</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Week 6</td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">[2022-09-26 Mon]</span></span></td>
<td class="org-left">Submanifolds; critical points</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">[2022-09-28 Wed]</span></span></td>
<td class="org-left">Regular value theorem</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">[2022-09-30 Fri]</span></span></td>
<td class="org-left">Transversal intersections</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Week 7</td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">[2022-10-03 Mon]</span></span></td>
<td class="org-left">Whitney&rsquo;s theorem</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">[2022-10-05 Wed]</span></span></td>
<td class="org-left"><b>Midterm exam</b> covering Sections 0&#x2013;6.</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">[2022-10-07 Fri]</span></span></td>
<td class="org-left">Vector fields</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Week 8</td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">[2022-10-10 Mon]</span></span></td>
<td class="org-left">Ordinary differential equations</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">[2022-10-12 Wed]</span></span></td>
<td class="org-left">Vector fields and Flows</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">[2022-10-14 Fri]</span></span></td>
<td class="org-left">Flows cont&rsquo;d.</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Week 9</td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">[2022-10-17 Mon]</span></span></td>
<td class="org-left">Lie bracket and Lie derivative</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">[2022-10-19 Wed]</span></span></td>
<td class="org-left">12. Distributions and the Frobenius theorem</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">[2022-10-21 Fri]</span></span></td>
<td class="org-left">13. Lie groups and Lie algebras</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Week 10</td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">[2022-10-24 Mon]</span></span></td>
<td class="org-left">14. Integrations of Lie algebras</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">[2022-10-26 Wed]</span></span></td>
<td class="org-left">15. The exponential map</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">[2022-10-28 Fri]</span></span></td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Week 11</td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">[2022-10-31 Mon]</span></span></td>
<td class="org-left">16. Groups of transformations</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">[2022-11-02 Wed]</span></span></td>
<td class="org-left">17. Differential forms and tensor fields</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">[2022-11-04 Fri]</span></span></td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Week 12</td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">[2022-11-07 Mon]</span></span></td>
<td class="org-left">18. Differential and Cartan calculus</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">[2022-11-09 Wed]</span></span></td>
<td class="org-left">19. Integration on manifolds</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">[2022-11-11 Fri]</span></span></td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Week 13</td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">[2022-11-14 Mon]</span></span></td>
<td class="org-left">20. de Rham cohomology</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">[2022-11-16 Wed]</span></span></td>
<td class="org-left">21. The de Rham theorem</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">[2022-11-18 Fri]</span></span></td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Week 14</td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">[2022-11-21 Mon]</span></span></td>
<td class="org-left">Fall break</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">[2022-11-23 Wed]</span></span></td>
<td class="org-left">Fall break</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">[2022-11-25 Fri]</span></span></td>
<td class="org-left">Fall break</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Week 15</td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">[2022-11-28 Mon]</span></span></td>
<td class="org-left">22. Homotopy invariance and Mayer-Vietoris sequence</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">[2022-11-30 Wed]</span></span></td>
<td class="org-left">23. Computations in cohomology</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">[2022-12-02 Fri]</span></span></td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Week 16</td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">[2022-12-05 Mon]</span></span></td>
<td class="org-left">24. The degree and the index</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">[2022-12-07 Wed]</span></span></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">[2022-12-08 Thu]</span></span></td>
<td class="org-left">Reading day</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">[2022-12-09 Fri]</span></span></td>
<td class="org-left">First day of finals</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Week 17</td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">[2022-12-16 Fri]</span></span></td>
<td class="org-left">Last day of finals</td>
</tr>
</tbody>
</table>
</div>
</section>
</main>
<footer id="postamble" class="status">
This website was made with <a href="http://www.gnu.org/software/emacs/">Emacs</a> <a href="http://orgmode.org">Org-mode</a>. The css stylesheets are taken from <a href="http://orgmode.org/worg">orgmode.org/worg</a> and are licensed under the <a href="http://www.gnu.org/licenses/gpl.html">GNU General Public License v3</a> or later.
</footer>
</body>
</html>
